#include"head.h"
//S=O(1),平均T=O(n*n),最坏T=O(n*n),稳定
void SqListInsertSort_Sentry(int a[], int n) {
	for (int i = 2;i < n;i++) {                 //a[0]作为哨兵,a[1]作为已排序列，依次将a[2]~a[n]插入已排序列
		if (a[i] < a[i - 1]) {                  //比较操作,判断是否进行移位操作
			a[0] = a[i];                        //设置哨兵，减少判断是否越界的比较操作
			int j;
			for (j = i - 1;a[j] > a[0];j--)     //多次比较操作,判断是否接着进行移位操作
				a[j + 1] = a[j];                //移位操作
			a[j + 1] = a[0];                    //插入操作
		}
	}
}
//最大比较次数：n(n-1)/2;最小比较次数：n-1;
//最大移位次数：n(n-1)/2;最小比较次数：0;
